---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SteelElementFailures.SteelElementTaskNotFinished
source: html/75c5c1af-f478-1446-c35c-aa5759fc4824.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SteelElementFailures.SteelElementTaskNotFinished Property

Advance Steel tasks not finished.

## Syntax (C#)
```csharp
public static FailureDefinitionId SteelElementTaskNotFinished { get; }
```